{
	"communications": {
		"install_lib_mex": "",
		"emergency": ""
	},
	"workinprogressblock": {
		"lock_operators": [
			""
		],
		"description": ""
	},
	"updates": {
		"3.1.100": {
			"date": "xx-xx-2024",
			"name": "HDRi Maker",
			"edition": "Studio",
			"url": "",
			"urgency": false,
			"video_embed_code": "",
			"lock_operators": [
				""
			],
			"descriptions": {
				"1": {
					"title": "Important!",
					"description": "Make sure after updating the addon to download and install the package available on the store called 'Custom Default Domes.exapack' these are the new Custom Domes"
				},
				"2": {
					"title": "Change - Ground Material Name",
					"description": "Ground Material becomes 'Environment Material', this to better identify the the material"
				},
				"3": {
					"title": "New Feature - Ground Material List",
					"description:": "Given the new update focused on custom domes, it has now become necessary to display the list of objects to which the projection material is applied in a classic Blender UI list, in order to make the interface as compact as possible"
				},
				"4": {
					"title": "New Hot Feature - Pin Projection",
					"description": "The 'Ground Material' can now be Pinned, so that once done, the projection will remain still even when moving the object in question"
				},
				"5": {
					"title": "New Hot Feature - Make Env Material Independent",
					"description": "This new feature allows you to make the Environment material applied to the object independent in terms of some properties such as 'Specular', 'Roughness', 'Metallic', etc. so that you can set independently from the 'Dome Color' such parameters. This is useful for example if there are objects that you want to make Reflective or Metallic, this will not affect other Environment objects or the dome"
				},
				"6": {
					"title": "New Hot Feature - Save Dome",
					"description": "Added the possibility to save the dome created or modified, in addition to the dome, all the objects related to it will be saved, such as ['Wrap', 'Ground Material (Now called 'Environment')', 'Hooks'] positions and rotations, it will be possible to rename or delete the saved domes"
				},
				"7": {
					"title": "New Feature - Smart Apply Environment Material",
					"description": "When the environment material is applied, it is now checked if the origin of the object axes is greater than 0.1 of the Z axis of the Global axes, if it is above this object will automatically assume the value Material Type == 'Top', otherwise 'GROUND'"
				},
				"8": {
					"title": "New Feature - Skip Boundary",
					"description": "The slider that adjusts the Boundary of the Dome Material or Environment Material, can now be disabled via this button. This is useful when working on environment objects, to eliminate any distortions. NOTE: This new parameter will be activated automatically by adding the Cube-Cylinder type Dome and will be disabled for the other types of domes"
				},
				"9": {
					"title": "New Feature - Tilt X and Y (Rotation)",
					"description": "Some users pointed out to me that some of their personal images do not have a perfectly level horizon, so they needed to be able to rotate the X and Y axis of the World and the Dome, so the properties have also been integrated to adjust the inclination"
				},
				"10": {
					"title": "Added - Find Source",
					"description": "Added a button to search for which library the hdr applied to the scene comes from, this will set the library preview in case the hdr file comes from a library connected to HDRi Maker, in case the file comes from a position on disk the folder containing the file will be opened"
				},
				"11": {
					"title": "Added - Find Library Source",
					"description": "In the addon preferences under the 'Libraries' tab to the left of each installed library there is now a button that if pressed opens the folder where the context library is installed"
				},
				"12": {
					"title": "Added - Hide Environment Objects and Wrap Objects",
					"description": "In the 'Properties' submenu of the 'DOME' panel, buttons are now available to respectively hide the Environment (The Old 'Ground objects') and Wrap Objects, this allows you to work better when creating custom domes"
				},
				"13": {
					"title": "Improve - Add Environment Material on multiple objects",
					"description": "Now you can add the Environment material to multiple objects at the same time"
				},
				"14": {
					"title": "Improve - Select Object Button",
					"description": "The buttons to select the Wrap objects and the objects on which the Dome material was applied, had a button to select them, the icon was the vector, now this button also performs the 'Hide Select' function by pressing it 2 times in this case the icon takes on the role of Hide Select just like in the Blender outliner. To make the object selectable again, just press it again."
				},
				"15": {
					"title": "Improve - Remove Dome Parts",
					"description": "Now when you remove the dome or the background, if the dome is present, objects to which the Environment material and Wrap objects were applied, will now also be removed, as they are part of the dome."
				},
				"16": {
					"title": "Improve - Purge images-node groups etc...",
					"description": "Every time you change a background, load a dome, remove background-dome, the management of unnecessary data is handled much better than the previous version, this to avoid duplicates of names with .001 .002 etc... and an excess of memory usage."
				},
				"17": {
					"title": "Improve - Dome Material Duplicate",
					"description": "In the case where the 'Remove' button is used from the main panel, if a Dome is present, the material applied to it remained in the data, Now it is removed. In addition, now when a dome is added, it is checked if the material is already present in the data materials, avoiding creating duplicates named with .001, .002, etc."
				},
				"18": {
					"title": "Improve - Sync Environment rotation buttons",
					"description": "Before this update these buttons were 2, one to synchronize, and the other to remove the synchronization of the rotation between the Environment of the dome and that of the World. Now it has been replaced by a single Boolean button"
				},
				"19": {
					"title": "Improve - Environment Material (Remove Problem)",
					"description": "If for some reason the material is removed manually from the object, the object still appeared to be projected, now instead, a red button will be shown, indicating that the material is not on the object, pressing the button, it will be applied again."
				},
				"20": {
					"title": "Improve - Enumerate Library",
					"description": "The library enumeration system is now more faster, the function has been improved"
				},
				"21": {
					"title": "Improve - Find Lost Images Update into all installed libraries",
					"description": "The 'Find Lost images' button in the addon options, if now the 'Shift' key is kept pressed, the search will be performed on all installed libraries and will not open the file browser for manual selection of the path"
				},
				"22": {
					"title": "Improve - Find Lost Images Update the render mode",
					"description": "The 'Find Lost Images' button in the addon options once pressed, it could happen that if blender was in render mode and the image was found, the background continued to be 'Pink', this because the only way seems to bring the shading type back to 'Material Preview', this could cause confusion, as it seemed that the background image was not found, in reality it was just an interface update problem that seems to work only by setting from 'Render' to 'Material Preview'"
				},
				"23": {
					"title": "Improve - Dome Display Wire",
					"description": "The 'Display Wire' property if there are objects to which the environment material is applied, they will also be displayed in wireframe in addition to the dome"
				},
				"24": {
					"title": "Improve - Apply Environment Material",
					"description": "In previous versions, if you tried to add the Dome material to an object where materials other than Dome were present, you would get a message that warned of the situation and blocked the operation (For security reasons) now instead, a popup with a message will always be displayed, but if you want to proceed, just press 'OK' from the popup, the operator will remove all the materials from the selected object and apply the Environment material"
				},
				"25": {
					"title": "Improve - Show Helps",
					"description": "In the previous versions of the 3.x series, the buttons (?) with the question mark were shown in each panel, now you can decide whether to hide them by deactivating the checkbox, accessing from the HELPS button of the main panel or from the addon preferences"
				},
				"26": {
					"title": "Improve - Add Hooks",
					"description": "Previously if there were already hooks in the dome, and the 'Add Hooks' button was pressed, the hooks were reset to the default position. Now a message will be launched that warns that the Hooks are already present, so the positions of the Hooks will no longer be reset"
				},
				"27": {
					"title": "Bug Fix - Material Selector in Edit Mode",
					"description": "If you were in the object's Edit Mode and changed the state from Ground to Sky or vice versa, the operation failed. Now it has been fixed."
				},
				"28": {
					"title": "Retro-compatibility - Old Dome HDRi Maker 2.0",
					"description": "If you opened a scene in which a dome of HDRi Maker 2.0 was present, it was not possible to remove it, and if you changed the background to the scene, the dome did not change image. Now it is possible to apply the image to the old dome in the scene, and by pressing 'Add Dome' the old dome will disappear in favor of the new one."
				},
				"29": {
					"title": "Deprecated support for Blender versions prior to 3.6",
					"description": "Support for Blender versions prior to 3.6 is deprecated, so if you try to install this version of HDRi Maker on Blender 3.5 or earlier, it will not work. We are also trying to maintain consistency with the Blender LTS system, of which version 3.6, today, is an LTS release still supported"
				},
				"30": {
					"title": "BugFix - Error when pressing the buttons in the material properties Only in Blender 3.6",
					"description": "An error occurred when pressing the buttons in the World and Dome material properties, this prevented correct operation in Blender 3.6 but not in later versions"
				},
				"31": {
					"title": "BugFix - Remove Ground Material",
					"description": "If on the object to which the ground material was added there is an empty material slot, when the button to remove the ground material was pressed, an error was obtained. This has been corrected by putting an exception"
				},
				"32": {
					"title": "BugFix - Projection Object",
					"description": "In the list of objects on which the material is projected, it could happen that by deleting the object from the scene, the object was still present in the list. Now if the object is deleted from the scene, but is still present in the data, it will no longer be shown in the list"
				},
				"33": {
					"title": "BugFix - Remove Projection Material Empty Slot",
					"description": "It could happen, and we are not yet clear about the reason, that by removing the Material for the projection on the object, an empty material slot remained that could not be removed even with the Blender buttons. This has been fixed by applying an API"
				},
				"34": {
					"title": "BugFix - Remove Projection Material",
					"description": "When you pressed 'Remove Dome', the materials for the projection on the objects remained applied. This should not happen, so now when you press 'Remove Dome', the Environment material is removed from all the objects in the scene on which it was applied"
				},
				"35": {
					"title": "BigFix - Unused Drivers",
					"description": "In the Blender console an error was displayed about the drivers, this happened because 2 drivers were added both on the World and on the Dome Material even in the absence of the object that controls them, that is the sun handler, This now no longer happens. In addition, in some versions of HDRi Maker the World had a 'prop' driver in bpy.data.materials, this has been removed. Note: If you open a project in which a Dome and a World created previously with HDRi Maker are present, this version needs to update the materials, so a button will appear, pressing this button will also fix the invalid drivers"
				}
			}
		},
		"3.0.121": {
			"date": "15-11-2024",
			"name": "HDRi Maker",
			"edition": "Studio",
			"url": "",
			"urgency": true,
			"video_embed_code": "",
			"lock_operators": [
				""
			],
			"descriptions": {
				"1": {
					"title": "Blender 4.3 Support - No Module Named toml",
					"description": "The Python module 'toml' is no longer included in Blender 4.3, it has been replaced by the tomllib module, this module is used to read the blender_manifest.toml file."
				},
				"2": {
					"title": "Blender 4.3 Support - Some APIs have changed",
					"description": "Some APIs have changed in Blender 4.3, this has caused some errors in the addon, now everything has been fixed, and the addon is fully compatible with Blender 4.3 and previous versions of Blender"
				},
				"3": {
					"title": "Debug admin problem",
					"description": "Some users reported having the Hdri Maker preference property 'debug' enabled, this showed an 'HDRi Maker Admin Panel' , it was not a bug, but we were unable to identify what could activate the addon preferences on admin==True, so this mode is now managed by the checkbox 'Show creator utility' already present in the options of HDRi Maker"
				},
				"4": {
					"title": "BugFix - Use Shadow (Cycles)",
					"description": "Starting from Blender 4.2 the 'Use Shadow' checkbox no longer worked returning an error in the console, this because the declared property was incorrect (sun.data.cycles.use_shadow) now it has been corrected to (sun.data.use_shadow) and works correctly"
				},
				"5": {
					"title": "BugFix - Update Message",
					"description": "After updating the addon to the latest version, the message informing of an available update was not hidden, it was possible to hide it only after pressing the 'Check addon update' button from the HDRi Maker preferences menu. This has been fixed by adding the call to the Blender startup to the function that compares the installed version with the newer one available"
				}
			}
		},
		"3.0.120": {
			"date": "27-06-2024",
			"name": "HDRi Maker",
			"edition": "Studio",
			"url": "",
			"urgency": true,
			"video_embed_code": "",
			"lock_operators": [
				""
			],
			"descriptions": {
				"1": {
					"title": "Library Previews Error in Blender 4.2",
					"description": "On Blender 4.2 an error could occur if Extreme PBR was installed (The Extreme PBR libraries were displayed in HDRi Maker), as with the change of Blender 4.2 APIs it created a conflict of names of that property, now it has been definitively fixed."
				},
				"2": {
					"title": "Hdr-Exr Shadow in 'Eevee Next' Blender 4.2",
					"description": "With the advent of Blender 4.2 now HDR backgrounds produce shadows, before this was not possible, now when you apply an HDR, the shadows will be activated by default using the 'use_sun_shadow' property"
				}
			}
		},
		"3.0.119": {
			"date": "15-06-2024",
			"name": "HDRi Maker",
			"edition": "Studio",
			"url": "",
			"urgency": true,
			"video_embed_code": "",
			"lock_operators": [
				""
			],
			"descriptions": {
				"1": {
					"title": "Compatibility with Blender 4.2",
					"description": "The new extensions/addons system uses a new blender_manifest.toml, which replaces the old bl_info, an update has been made to make HDRi Maker compatible with Blender 4.2 while maintaining retro-compatibility with previous Blender versions"
				},
				"2": {
					"title": "Error Fix - On activation of HDRi Maker",
					"description": "When you activate the addon, that is, by checking the checkbox to activate it in Blender, an error was produced, as an Essential function, which reattaches the libraries automatically, was executed during the registration of the addon, in the function in it there is the autosave, missing the context, the operator threw an error, this was simply fixed by delaying the execution of the function by 1 second via a bpy.app.timers"
				},
				"3": {
					"title": "Fix - Error when deactivate and reactivate the addon preview",
					"description": "A function to unregister the texture previews was not executed correctly, if the addon was deactivated and reactivated, an error was shown in the console, this happened because the function was not called, now it is called correctly and the error is no longer present"
				},
				"4": {
					"title": "Added - Raytracing activation (Blender 4.2)",
					"description": "In Blender 4.2 the use_raytracing property has been added, this property will be activated automatically by adding a Background/ a Dome/ a Shadow Catcher, it will be recognized automatically if the current version of Blender is 4.2, otherwise it will be ignored"
				},
				"5": {
					"title": "Added - Hide Wrap Objects",
					"description": "A new button has been added to hide the Wrap objects, this is useful because in in Viewport Shading Mode Rendered, the Wrap objects are visible and can be annoying, now you can hide them"
				}
			}
		},
		"3.0.118": {
			"date": "18-03-2024",
			"name": "HDRi Maker",
			"edition": "Studio",
			"url": "https://www.youtube.com/watch?v=cj6CAFMdgYI",
			"urgency": true,
			"video_embed_code": "<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/cj6CAFMdgYI?si=VJV7n-bxsefYAiX1\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe>",
			"lock_operators": [
				""
			],
			"descriptions": {
				"1": {
					"title": "BugFix - Dome Material HDR Light range",
					"description": "The dome material had a Mix node with Clamp Result setting activated, this caused the loss of the light range of the HDR image, this has been fixed simply by correcting that property that was active"
				},
				"2": {
					"title": "Improvement - Update menu Preferences",
					"description": "The Updates menu for exapacks has been greatly improved, now it is much faster and has an improved grid to see what is available to download and what has been installed"
				},
				"3": {
					"title": "Improvement - Dome Handler Free",
					"description": "From this version the property **Enable Manual Control** has been added to make the dome free, so the movement of location, rotation and scale of the dome can be managed directly in the 3D viewport. In addition, some buttons have been added to allow you to Reset the positions of the dome, deactivating the property **Enable Manual Control** the dome will return to the origin of the scene axes, that is, at the point (0,0,0) The Handler is an object of type Empty, and now it can be replaced with all the types available in Blender, in addition its size can be adjusted without this affecting the size of the Dome"
				},
				"4": {
					"title": "Added - Exposed the Z location of the World Background",
					"description": "Now the Z location of the World Background can be managed directly from the HDRi Maker panel, this was present until version 2.0 and given the many requests from users, it has been exposed again in the HDRi Maker World panel"
				},
				"5": {
					"title": "Improvement - Remind me later",
					"description": "If the addon shows that an update is available in the main panel, now it is possible to hide the message by choosing how long it should not be shown, from a minimum of 1 day to a maximum of 15 days, this is to keep important updates in view, as they will be reported as such in that context"
				},
				"6": {
					"title": "BugFix - Empty Material Slot into the Dome",
					"description": "It could happen for some error, that an empty material slot was inside the dome objects, so when trying to delete the Background with the Remove button, an error was raised, and made it impossible to delete the dome. This has now been corrected with an exception if there is an empty material slot"
				}
			}
		},
		"3.0.117": {
			"date": "21-02-2024",
			"name": "HDRi Maker",
			"edition": "Studio",
			"url": false,
			"urgency": true,
			"lock_operators": [
				""
			],
			"descriptions": {
				"1": {
					"title": "Fix - Update for Blender 4.1 API",
					"description": "Update to the new Blender 4.1 API and various fixes for the addon to work on Blender 4.1"
				},
				"2": {
					"title": "Fix - Asset Browser Creation Popup Message",
					"description": "Regardless of the library you wanted to create, the text relating to the creation of the Default Library was always shown, in truth it was just a code error, as the selected library was actually created with the button, it was just a misleading message. Fixed, now shows the right text"
				}
			}
		},
		"3.0.116": {
			"date": "02-11-2023",
			"name": "HDRi Maker",
			"edition": "Studio",
			"url": false,
			"urgency": true,
			"lock_operators": [
				""
			],
			"descriptions": {
				"1": {
					"title": "BugFix - Reuse images",
					"description": "The texture image loading script analyzed whether the image was already present in the project and checked whether the image had the data via image.has_data, this could happen if the image did not have has_data an error was raised in the texture loading. The script has been improved and if there is no has_data, the image is now reloaded correctly"
				},
				"2": {
					"title": "BugFix - Add Dome-Hooks Error",
					"description": "It happened that if the VIEW_3D windows were more than one, trying to add a Dome or adding the Hooks to the Dome raised an error 'TypeError: Region not found in area', this because the function that did the override did not take into account the Region, but only the area, so everything worked fine only if the 3D windows was only one."
				}
			}
		},
		"3.0.115": {
			"date": "12-10-2023",
			"name": "HDRi Maker",
			"edition": "Studio",
			"url": false,
			"urgency": false,
			"lock_operators": [
				""
			],
			"descriptions": {
				"1": {
					"title": "Improvement - Support For Blender 4.0",
					"description": "Now HDRi Maker also works on Blender 4.0 maintaining backward compatibility with previous versions from 3.0 onwards"
				},
				"2": {
					"title": "BugFix - Export Image",
					"description": "From the Save Menu, Export image did not work well, the Blender image.has_data APIs always returned False, now I have solved it by updating the image before checking if image.has_data with image.update()"
				},
				"3": {
					"title": "BugFix - Batch Save",
					"description": "If the batch save contained a .blend file and the .blend file for some reason did not have a world, this created an error, now it is bypassed, in addition at the end of the operation. In addition, now the preview icons are redrawn in order to make the backgrounds immediately available from the HDRi Maker Browser menu"
				},
				"4": {
					"title": "BugFix - Add Diffuse/Light Bug (Convert World to HDRi Maker World)",
					"description": "If you added a Diffuse or Light, from the 'World' panel if the World nodes had not been created with HDRi Maker, they were no longer added to a Group (Which had to be created) now, the group will be created and positioned correctly both as Diffuse and as Light"
				},
				"5": {
					"title": "Improve - Restore Node Value",
					"description": "The confirmation method has been improved with a new popup"
				}
			}
		},
		"3.0.114": {
			"date": "30-09-2023",
			"name": "HDRi Maker",
			"edition": "Studio",
			"url": false,
			"urgency": false,
			"lock_operators": [
				""
			],
			"descriptions": {
				"1": {
					"title": "Bugfix - Add light during paint mode error",
					"description": "If you were in paint mode and tried to add a light, an error occurred, this has now been fixed by adding the object mode check"
				},
				"2": {
					"title": "Improvement - Link Unlink World-Dome Rotation Buttons",
					"description": "A depress state has been added to the respective buttons for the synchronization of the dome and background rotation, now when the respective driver is activated, the button lights up, to indicate that it has been activated, and turns off in case of unlink or activation of the opposite driver"
				},
				"3": {
					"title": "Patch - Regeneration of Preview Icons",
					"description": "A button named 'Regenerate Previews and Icons' has been added in the options section, this button regenerates the icons and the preview icons of the backgrounds, now also regenerates the icons damaged by the Beta-Alpha versions of Blender, so they are regenerated simply by copying and deleting the damaged icons and reloading the Background Previews"
				},
				"4": {
					"title": "Added - Purge Cache Button into Options Section",
					"description": "HDRi Maker uses Json files that store library paths, so that whenever the addon is installed in a new version of Blender, the addon itself recognizes the library paths set by another version of Blender, this is also useful for update the addon, which in fact, once updated and started Blender, will automatically recognize the library paths. There have been some cases, however, that the addon stored paths that no longer existed, and for some reason they were not removed automatically, for this reason this button has been added, which in addition also removes all the .json files present in the addon folder called 'online_utility', these files are for updates and other online functions, these are always deleted via this button"
				},
				"5": {
					"title": "Fix - Library paths storage",
					"description": "It has been reported to us that the library paths stored in the .json file present in the ExtremeAddons folder (As explained in the previous point) may no longer exist, so if this is the case, they will be ignored and no longer set to the default and user libraries so as to avoid confusion"
				}
			}
		},
		"3.0.113": {
			"date": "29-07-2023",
			"name": "HDRi Maker",
			"edition": "Studio",
			"url": false,
			"urgency": false,
			"lock_operators": [
				""
			],
			"descriptions": {
				"1": {
					"title": "Bugfix Json Save",
					"description": "During the saving of json files, it could happen that if blender stopped abnormally, the json file would be corrupted. Now a temporary saving system has been implemented, only if the writing is successful, the file is then converted to json. This to avoid corrupted files"
				},
				"2": {
					"title": "Bugfix - Error during the creation of the Asset Browser",
					"description": "In some cases (Probably still to be fully understood) the process was blocked by an error if the background file was not present in the library folder, so an exception was put, in case it occurred, the process bypasses the background and continues"
				},
				"3": {
					"title": "Improvement - Added additional warning if the background file is not present",
					"description": "As described in the previous point, if the preview file is not present, by pressing the 'Add' button an additional message will now be shown informing in which exapack volume the missing background is present, so that you can download only that package"
				}
			}
		},
		"3.0.112": {
			"date": "14-07-2023",
			"name": "HDRi Maker",
			"edition": "Studio",
			"url": false,
			"urgency": false,
			"lock_operators": [
				""
			],
			"descriptions": {
				"1": {
					"title": "Alpha - Beta Version Alert Message added",
					"description": "If the version of Blender used is a Beta or Alpha version, a message will be displayed in the main interface of the addon, a confirmation button will hide the message until the next start of Blender, this has been added because many users try the new unstable versions of Blender and sometimes the addons don't work, I hope this message is useful"
				},
				"2": {
					"title": "Node Alignment improved",
					"description": "Added a function that better calculates the size of the nodes, even in conditions where the nodes are not displayed, the node.dimensions property does not work until the nodes are displayed, a log with the dimensions of the nodes has been added via file.json"
				},
				"3": {
					"title": "Bugfix - Add background reset the orientation and the other properties",
					"description": "If you add an HDR in version 1k and then replace it with the same background at another resolution (For example 4k) the background rotation was reset, this no longer happens, the rotation remains unchanged and also the other properties"
				},
				"4": {
					"title": "Improvement - Library paths updated when the addon is activated",
					"description": "When the addon is activated with the checkbox, if it was already activated before, it now updates the library paths and you don't have to reassign the paths. This only happens if HDRi Maker was already installed and with the library paths already assigned (It only works if the paths were assigned in the previous 3.x version)"
				},
				"5": {
					"title": "Bugfix - Error Index negative during Add Hooks in Blender 3.6",
					"description": "For some reason, the vertex indices of the Dome, changed to negative indices during the compilation of the vertex list and the assignment of a Modifier for each Hook. Now the list is compiled in a further step and the indices no longer change."
				}
			}
		},
		"3.0.111": {
			"date": "08-05-2023",
			"name": "HDRi Maker",
			"edition": "Studio",
			"url": false,
			"urgency": true,
			"lock_operators": [
				""
			],
			"descriptions": {
				"1": {
					"title": "Bugfix - Error During Asset Browser Creation",
					"description": "In some cases (Probably still to be fully understood) it showed a mat_info.get() error, this is because an exception had not been set to check if mat_info really existed. It has now been fixed and the error will no longer appear"
				},
				"2": {
					"title": "Added - Remind me later button",
					"description": "In order to hide the update message (If the addon need update) a new button has been added to the message, this button will hide the message in the current Blender Session"
				},
				"3": {
					"title": "Bugfix - check_existing Error",
					"description": "During the creation of the Asset Browser In versions prior to Blender 3.4 an error (check_existing) occurred, this was due to the fact that the check_existing parameter was not present in the bpy.ops.preferences.asset_library_add operator, now this parameter has been removed if the Blender version is prior to 3.4"
				}
			}
		},
		"3.0.110": {
			"date": "29-03-2023",
			"name": "HDRi Maker",
			"edition": "Studio",
			"url": false,
			"urgency": true,
			"lock_operators": [
				""
			],
			"descriptions": {
				"1": {
					"title": "Added - Creation of library in Asset Browser",
					"description": "For now it is limited to Worlds only, if drag and drop is done, only the world is added. All other features need to be added via the HDRi Maker panel. This python API limitation of Asset Browser."
				},
				"2": {
					"title": "Added - Convert World to HDRi Maker World",
					"description": "Now if the World is not of type HDRi Maker, the usual menu appears in the HDRi Maker World panel, with a button called TRY TO CONVERT, this operator, attempts to convert any World to an HDRi Maker World. This will only work if there is an HDR/EXR File in the World. This for obvious reasons, first of all, will allow you to use some functions present only if the group nodes are recognized by HDRi maker."
				},
				"3": {
					"title": "Added - Reload Dome Image",
					"description": "A new Reload Image button has been added to the Dome menu. This is useful if you work with asset browsers, once any World (even of a non-HDRi Maker type) has been added, it can also be added to the dome, without necessarily having to add a new dome. This works provided that in the World Added to the scene, there is an HDR or EXR image inside the World nodes."
				}
			}
		},
		"3.0.105": {
			"date": "16-03-2023",
			"name": "HDRi Maker",
			"edition": "Studio",
			"url": false,
			"urgency": false,
			"lock_operators": [
				""
			],
			"descriptions": {
				"1": {
					"title": "Bugfix - Pose Mode Bug",
					"description": "If in Pose Mode, trying to add Backgrounds-Dome-Lamps, an error occurred. This has now been fixed, if you are in pose mode and do one of the above operations, the object goes back to Edit Mode, and the script executes correctly."
				},
				"2": {
					"title": "New feature - Dome Rotation",
					"description": "A property has been added to rotate the Dome, this is useful, because when the Hooks are applied, now the Hook will rotate with the dome, in order not to have to rotate the objects in the scene"
				},
				"3": {
					"title": "Bug Fix - Installation User Library Missing",
					"description": "It could happen that during the first installation, the user chose the USER_LIBRARY directory, in a non-existent location, this did not start HDRi Maker and had to be removed, then add the USER LIBRARY, now this is solved, The addon if it sees that there is no USER Library In the chosen path, it will create it automatically during installation (Exapack installation) This already happened, but only if no User Library path was selected"
				},
				"4": {
					"title": "Improvement - Save the Expansion Library directories",
					"description": "When you update the addon from version 3.x and up of HDRi Maker, the addon now also saves the directories and names of the Expansion Library, so that if you update the addon, you do not have to re-indicate the paths of the Expansion Library. Now all directories are stored in a json file, in order to simplify the update phase of the addon. Even when you switch to a later version of Blender, the addon always recognizes the directories, as long as they still exist and have not been moved on the computer to another location"
				}
			}
		},
		"3.0.104": {
			"date": "03-03-2023",
			"name": "HDRi Maker",
			"edition": "Studio",
			"url": false,
			"urgency": true,
			"lock_operators": [
				""
			],
			"descriptions": {
				"1": {
					"title": "Bugfix - Retro-compatibility Dome Material",
					"description": "Dome material was reflective on Blender versions 3.0 to 3.3 (Not on 3.4) Fixed issue, it was the Mix nodes that didn't have proper input and black was grayed out, causing reflection to always be on, and also the metallic. Now everything should work from Blender 3.0 and up. Previous versions have been abandoned, as they are now obsolete. a positive note for the support of Blender 3.3 which is an LTS release, so it is necessary to make HDRi Maker workable on it."
				}
			}
		},
		"3.0.103": {
			"date": "03-03-2023",
			"name": "HDRi Maker",
			"edition": "Studio",
			"url": false,
			"urgency": true,
			"lock_operators": [
				""
			],
			"descriptions": {
				"1": {
					"title": "Bugfix - (Choose path) For Mac and Linux",
					"description": "For some reason, it was no longer possible to select the library paths. I had used the ntpath.normpath module to make sure I normalized the paths. It worked during testing, but now it doesn't work anymore on Mac and Linux. Maybe I missed something. The new version checks the path with os.path.normpath. You should now be able to select the path to the libraries correctly"
				}
			}
		},
		"3.0.102": {
			"date": "02-03-2023",
			"name": "HDRi Maker",
			"edition": "Studio",
			"url": false,
			"urgency": true,
			"lock_operators": [
				""
			],
			"descriptions": {
				"1": {
					"title": "Bugfix when installing expansions",
					"description": "It could happen that during the installation of Expansions, if they were already present on the disk and not in the list of HDRi Maker expansions, they were installed in the Default library. This could rarely happen, only if they had already been installed before. I fixed this to avoid potential confusion in some rare cases."
				},
				"2": {
					"title": "Bugfix: Removes files of expansion volumes",
					"description": "Expansion volumes were not removed from the Updates menu, they can now be removed."
				}
			}
		},
		"3.0.101": {
			"date": "01-03-2023",
			"name": "HDRi Maker",
			"edition": "Studio",
			"url": false,
			"urgency": true,
			"lock_operators": [
				""
			],
			"descriptions": {
				"1": {
					"title": "Installation Bugfix for Mac-Linux",
					"description": "For some reason, using os.path.realpath didn't work well on Mac and Linux. It has been replaced with ntpath.normpath module, this blocked the installation of files.exapack now it's back it works on Win-Mac-Linux"
				}
			}
		},
		"3.0.100": {
			"date": "28-02-2023",
			"name": "HDRi Maker",
			"edition": "Studio",
			"url": false,
			"urgency": true,
			"lock_operators": [
				""
			],
			"descriptions": {
				"1": {
					"title": "Completely redesigned interface",
					"description": "The new interface has been completely redesigned to be simpler and more intuitive, we have inserted custom menus for each functionality of the addon, now the menus are sortable"
				},
				"2": {
					"title": "Addon rewritten almost from new",
					"description": "All the code has been reviewed and structurally improved"
				},
				"3": {
					"title": "New panel structure",
					"description": "The panel has been completely revised and improved, now it is divided into sections that can be moved open and close at will"
				},
				"4": {
					"title": "Tag system added",
					"description": "Now all backgrounds have tags that allow you to filter the search"
				},
				"5": {
					"title": "New Volumetric system",
					"description": "Now the Volumetric is managed by a group node system, this simplifies the addition in the future of new volumetric nodes, this for the simulation of fog and dust"
				},
				"6": {
					"title": "Diffuse and Light management added",
					"description": "You can now add a solid background with HDR lighting, for example, you can add a completely Black background, using the lighting of an HDRi"
				},
				"7": {
					"title": "Shadow Catcher Eevee",
					"description": "The Eevee Shadow Catcher has been revised and improved. But the support for the displacement of the shadow catcher has been removed, this was not very functional"
				},
				"8": {
					"title": "Lights (Light studio)",
					"description": "A new panel dedicated to lighting functions. Here you can manage the lights or the sun, and the lighting settings"
				},
				"9": {
					"title": "Ability to animate all (or almost all the sliders)",
					"description": "Previously HDRi Maker did not allow you to animate the sliders, this because the properties did a callback to the main property, now this problem has been solved, because I adopted the same drawing technique of the panel, thanks to the experience gained with Extreme PBR, All sliders (Or Almost) can be animated with keyframes"
				},
				"10": {
					"title": "Library link management improved",
					"description": "The library management system is simpler, the paths to the libraries are opened via button, this to avoid the problem of relative paths, same system adopted in Extreme PBR"
				},
				"11": {
					"title": "Additions of Expansion Packs",
					"description": "From this version, it is possible to add Expansion, 1 Expansion is already provided with the addon, this Expansion, contains more than 100+ new backgrounds from HdrMaps.com, the owner of this site has approved with pleasure the use of his backgrounds, for this reason, it was decided to add this Expansion"
				},
				"12": {
					"title": "Import on the fly",
					"description": "By pressing the SHIFT key and the ADD button, you can import a background on the fly, this allows you to use your Background, without having to add it to the library"
				},
				"13": {
					"title": "Dome (Classic) Improved",
					"description": "I recreated the dome with care, paying attention to its topology. This to be able to divide the dome with a modifier, in order to improve the experience with the Wrap system already present in the past"
				},
				"14": {
					"title": "Wrap system improved",
					"description": "Now the Wrap system, has the possibility to decide the direction of the Wrap on the ground, (Negative or Positive), in addition now the Wrap objects are listed in the dedicated panel"
				},
				"15": {
					"title": "Ground Material system improved",
					"description": "Now the addition of the Ground material has been improved, every object to which the Ground material is applied, is now listed in the dedicated panel, in addition it is possible to choose the function of this material in 2 options, the first assumes the ground projection, the second assumes the Top dome projection, this allows you to project on the object the same projection of the dome in the upper part"
				},
				"16": {
					"title": "Dome Material Improved",
					"description": "Now the dome material and all its nodes, have been improved and revised, this now allows greater control on the projection of the dome, allowing to adjust and stretch the upper or lower part (Ground) of the dome"
				},
				"17": {
					"title": "Dome Cube Added",
					"description": "A new dome in the shape of a cube has been added, the projection now also takes place on a cube"
				},
				"18": {
					"title": "Dome Cylinder Added",
					"description": "A new dome in the shape of a cylinder has been added, the projection now also takes place on a cylinder"
				},
				"19": {
					"title": "Two variants to the classic Dome Added",
					"description": "Another 2 versions of the classic dome have been added, these 2 versions are similar, but the curvature that is between the ground part and the top part changes"
				},
				"20": {
					"title": "Dome Hooks Added",
					"description": "The new Hooks system allows you to modify the shape of the dome, to modify the shape of the dome, and adapt it to the projected image, for example you can recreate the angle of a wall present in the image (This only works on dome Cube and dome Cylinder at the moment)"
				},
				"21": {
					"title": "Reflection Plane On the dome",
					"description": "When you add a dome, now a reflection plane is added on the ground, in order to be able to add realistic reflections on the ground in Eevee mode"
				},
				"22": {
					"title": "Dome With Bump Map",
					"description": "Now on the ground of the dome it is possible to add a Bump Map effect, this is simulated by the same image projected on the dome, in order to be able to create a roughness effect on the ground"
				},
				"23": {
					"title": "Shadows on the Ground",
					"description": "Now the area where the dome receives shadows has been improved and faded, you can now decide how far the ground receives shadows (In the previous version this detachment was almost sharp, and created a color change problem between the ground and the rest of the dome)"
				},
				"24": {
					"title": "Reflections on the Ground",
					"description": "As mentioned earlier, now it is possible to add reflections on the ground, metallic and roughness effect "
				},
				"25": {
					"title": "Sun, Background, Dome Synchronization",
					"description": "Now you can choose whether to synchronize the sun, the dome with the background. This thanks to the addition of drivers if needed"
				},
				"26": {
					"title": "Improved Blur background effect",
					"description": "The Blur effect of the background has been improved, in the previous version there were graphical errors in some points of the background, now this has been solved"
				},
				"27": {
					"title": "Blur effect in the dome",
					"description": "Now it is possible to add a Blur effect in the dome, The effect can be managed based on the distance of the observation point and be inverted (Similar to the effect of the camera depth of field)"
				},
				"28": {
					"title": "New installation system",
					"description": "From this version the installation of the libraries takes place through packages with .exapack extension this format is recognized by the addon and is managed by the new installer"
				},
				"29": {
					"title": "Improved update control",
					"description": "Now the update check takes place on an online json file. Before the check system was obsolete and took place on the Blendermarket page"
				},
				"30": {
					"title": "New documentation",
					"description": "Now the online documentation has been improved, now throughout the addon it is possible to access it through the buttons with the (?) icon, this opens directly the online documentation page to the corresponding page"
				},
				"31": {
					"title": "Improved the import of Backgrounds",
					"description": "Now you can Try to import World Backgrounds from your .blend files, the addon tries to recover the first Background from the .blend project, this is not guaranteed to work every time, but in most cases if your .blend file contains a Background, it will be imported correctly"
				}
			}
		}
	}
}